Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ལས་ཅི་བགྱིས་ན་དེ་ནས་ཤི་འཕོས་ཏེ་མིར་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: What did she do after she died and took rebirth as a human being that she pleased and did not displease the Blessed One, went forth in the Blessed One’s doctrine, cast away all afflictive emotions, and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: དགེ་སློང་དག་འདས་པའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་ལ་ད་ལྟར་བྱུང་བའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་དོ། །
en: “Monks, it was partly her past actions, and it is partly her present actions as well.”

source: བཙུན་པ་འདས་པའི་ལས་ཅི་བགྱིས་ལགས།
en: “Lord, what action did she take in the past?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན།
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years and

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་ལས་
en: the blessed buddha known as Kāśyapa was in the world, there lived a certain householder in the city of Vārāṇasī.

source: ཕྱིས་དེ་ལ་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: “One day a child was born to him who was well proportioned, pleasing to the eye, and beautiful.

source: གང་གི་ཚེ་དེ་ཆེན་མོར་གྱུར་པ་དང་། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་ཕ་མ་ལ་གསོལ་ཏེ་རབ་ཏུ་བྱུང་ངོ་། །
en: As she grew up she gained faith in the doctrine of the totally and completely awakened Buddha Kāśyapa and asked her parents if she could go forth.

source: རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ། དེ་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བ།
en: Once she had gone forth, she studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of her wisdom and freedom.

source: གོས་དང་ཟས་དང་མལ་ཆ་དང་། སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ནས་དེས་བསམས་པ་མ་ལ་བདག་གིས་རྙེད་པ་དང་བཀུར་སྟིའི་སྒོ་ནས།
en: “Having acquired provisions of clothing, food, bedding, a seat, and medicines for the sick, she thought, ‘How wonderful!

source: རྙེད་པར་བྱ་བ་རྙེད་པ་གང་ཡིན་པ་དེས། བདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཕན་གདགས་པར་བྱ་གོར་མ་ཆག་
en: With all the profit and acclaim I’ve gained, I can see to the welfare of fellow practitioners of the holy life.’

source: ཆོས་བཞིན་དུ་གཉི་གའི་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་སོ། །
en: And she served the twofold saṅgha in accordance with the Dharma.

source: དེ་ནས་ཕྱིས་དེ་ལ་བྲེལ་བ་ཞིག་བྱུང་སྟེ། དེས་སློབ་པ་དང་མི་སློབ་པའི་དགེ་སློང་མ་མང་པོ་ཞིག་ལ་གསོལ་བ་བཏབ་ན།
en: “One day when she was busy, she asked for help from a group of nuns who were on the paths of learning and no more to learn.

source: དེ་དག་ན་རེ་བདག་ཅག་གི་དགེ་བའི་ཕྱོགས་བཏང་སྟེ། ཁྱོད་ཀྱི་དོན་བསྒྲུབ་མི་ནུས་སོ་ཞེས་ཟེར་རོ། །
en: They replied, ‘We cannot abandon our virtuous works to accomplish your task.’

source: དེ་ནས་དེ་ཐོས་པའི་མོད་ལ་དགེ་སློང་མ་དེ་ཤིན་ཏུ་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་སྐྱེས་ཏེ།
en: “When she heard this she bristled with fury.

source: དེ་ཁྲོས་ནས་ དགེ་སློང་མ་དེ་དག་ལ་སྨྲས་པ།
en: Seething, the nun shouted at them,

source: ང་ནི་ཁྱི་མོ་དང་འདྲ་བ་ཁྱེད་དགང་བ་དང་གསོ་བ་འབའ་ཞིག་བྱེད་ན་ཁྱེད་ནི་སྐད་ཅིག་ཙམ་བདག་གི་དོན་བྱེད་དུ་ཡང་མི་བཏུབ་བམ་ཞེས་བྱས་སོ། །
en: ‘You’re like dogs! All I do is look after you and fill your stomachs—can you not help me for even a moment?’

source: དེ་ནས་དགེ་སློང་མ་དེ་རྣམས་ཀྱིས་བསམས་པ། ཉོན་མོངས་མ་འདི་ནི་དམས་ཤིང་ཉམས་པར་གྱུར་ཏེ། འཁོར་བ་ན་འཁོར་ཞིང་སྡུག་བསྔལ་ཆེན་པོ་རྙེད་ན་མི་རུང་ངོ་
en: “Thereupon the nuns thought, ‘It’s not right for this emotionally afflicted person, so abased, to circle in saṃsāra and meet with great suffering.’

source: སྙམ་དུ་བསམས་ནས། འདིའི་ར་མདའ་བྱ་དགོས་སོ་སྙམ་སྟེ་དེ་དག་གིས་སྨྲས་པ། ཁྱོད་ཀྱིས་ངེད་སུ་ཡིན་པ་དང་། ཁྱོད་བདག་སུ་ཡིན་པ་ཤེས་སམ་དེས་སྨྲས་པ།
en: Reflecting in this way, they thought, ‘We have to help her,’ and asked, ‘Do you know who we are? And do you know who you yourself are?’ “

source: ངས་ཤེས་ཏེ་ཁྱེད་ཀྱང་རབ་ཏུ་བྱུང་བ་ཡིན་ལ་ང་ཡང་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ། །
en: ‘I know,’ she replied, ‘that you have gone forth, as have I.’

source: དེ་དག་གིས་སྨྲས་པ།
en: “The nuns responded,

source: ཆེ་ཞེའུ་བུ་ཅག་རབ་ཏུ་བྱུང་བར་འདྲ་མོད་ཀྱི། ཁྱོད་ནི་བཅིང་བ་ཐམས་ཅད་ཀྱིས་བཅིངས་པའི་སོ་སོའི་སྐྱེ་བོ་ཡིན་ལ་ངེད་ནི་བྱ་བ་བྱས་པ་ཡིན་གྱིས་
en: ‘Though as your elder sisters we have gone forth as you have, you are an ordinary person, bound by every fetter, whereas we have accomplished our task.

source: ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: So acknowledge your mistake as such.

source: ཁྱོད་འཁོར་བ་ན་འཁོར་ཞིང་སྡུག་བསྔལ་ཆེན་པོ་རྙེད་ཏ་རེ།
en: Otherwise you are certain to roam in saṃsāra and meet with great suffering.’

source: དེ་སྐད་ཐོས་པའི་མོད་ལ་དགེ་སློང་མ་དེ་འགྱོད་པ་ཆེན་པོ་སྐྱེས་ཏེའགྱོད་པ་ཆེན་པོ་སྐྱེས་ནས། ལྷག་པར་ཡང་ཆོས་བཞིན་དུ་གཉི་གའི་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་ཏེ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས།
en: “Hearing their words, the nun was flooded with regret, and with renewed vigor she offered her respectful service to the twofold saṅgha and practiced pure conduct all her life.

source: འཆི་ཀར་སྨོན་ལམ་བཏབ་པ། ཀྱེ་མ་བདག་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པའི་དགེ་བའི་རྩ་བ་འདིས་ནི་
en: “At the time of her death, she prayed, ‘Oh, but by the root of virtue of my having gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, my lifetime of practicing pure conduct, and the service I rendered in accord with the Dharma,

source: བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཅི་ནས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བ་དང་།
en: wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཅིག །
en: May I be well proportioned, pleasing to the eye, and beautiful.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག །
en: Going forth in his doctrine alone, may I cast away all afflictive emotions and manifest arhatship.

source: བདག་ཁྲོས་ནས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པ་གང་ཡིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པའི་སྐལ་བ་ཅན་དུ་བདག་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I not meet with the results of the act of speaking harshly to those fellow practitioners of the holy life.’

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མ་འདི་ཉིད་ཡིན་ཏེ།
en: “O monks, what do you think? The one who was that nun then is now this nun.

source: དེས་དེར་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དེ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ཚེ་རབས་ལྔ་བརྒྱར་ཁྱིར་སྐྱེས་སོ། །
en: The ripening of the act of speaking harshly to those fellow practitioners of the holy life caused her to be reborn as a dog for five hundred lifetimes.

source: དེས་དེར་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At the time of her death she prayed,

source: བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: ‘Wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་
en: Going forth in his doctrine alone, may I cast away all afflictive emotions and manifest arhatship.’

source: བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། འདི་ད་ལྟར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: And that action ripened such that she was born into a family of great means, prosperity, and wealth.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa— equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་པ་
en: that she has pleased me, not displeased me, go forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: འདི་ནི་འདིས་འདས་པའི་ལས་ཡིན་ནོ། །
en: These were her past actions.

source: ད་ལྟར་བྱུང་བའི་ལས་ཅི་ཞིག་བྱས་ཞེ་ན།
en: “You may ask, ‘What are her present actions?’

source: དེ་ཁྱིར་སྐྱེས་ནས་ཤཱ་རིའི་བུ་ལ་སེམས་དགའ་བར་གྱུར་པ་
en: Born as a dog, she was filled with joy at the thought of Śāriputra.

source: དེས་ནི་མིའི་ནང་དུ་སྐྱེས་ཏེ།
en: Because of this she took birth among humans.

source: འདི་ནི་ད་ལྟར་བྱུང་བའི་ལས་ཡིན་ནོ།། །།
en: These are her present actions.”

source: མིག་ཆུང་ཞེས་བྱ་བ་ནི།
en: The Story of Little Eyes

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་
en: When the Blessed One was in Śrāvastī there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means,

source: རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱིས་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ། བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་། བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ། རིགས་དང་འཐུན་པར་མིང་བཏགས་ནས།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་དེ་གང་གི་ཚེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids,

source: འགྲོ་ནུས་པར་གྱུར་པ་དེའི་ཚེ། དེ་རྩེར་གཞུག་པའི་ཕྱིར་ཕས་ཁྱི་གུ་ཞིག་ཁྱིམ་དུ་བཞག་སྟེ་ཁྱེའུ་ལ་བྱིན་ནོ། །
en: and once he was able to walk, his father brought home a puppy and gave it to the child to play with.

source: དེ་ནས་ཁྱེའུ་དེས་ཁྱི་གུ་དེ་ཟ་བ་བསླབས་སོ། །དེ་ནས་གང་གི་ཚེ་ཁྱི་གུ་དེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ལམ་པོ་ཆེར་སོང་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཡང་ཟ་བར་བྱེད་དོ། །
en: The child taught the puppy how to eat, and when the puppy had grown, he went out to the road and many others fed him as well.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ།
en: The buddhas, the blessed ones, teachers of the one path to be traversed,

source: རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ།
en: with mastery over wisdom and the two types of knowable objects,

source: མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ་མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ།
en: in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness,

source: འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ་སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ།
en: freed from migration through the five destinies, keen in the six sense bases,

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ།
en: practiced in the seven limbs of enlightenment,

source: རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ།
en: focused on the eight liberations,

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ།
en: absorbed in the nine successive meditative absorptions,

source: སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ་ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night.

source: སུ་ནི་རྒུད་སུ་ནི་དར།
en: “Who is in decline? Who will flourish?

source: སུ་ནི་ཉམ་ང་བར་གྱུར།
en: Who is in a dreadful state?

source: སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན།
en: Who is destitute, in a dreadful state, and being harmed?

source: སུ་ནི་ངན་སོང་དུ་འབབ།
en: Who is descending through the lower realms?

source: སུ་ནི་ངན་སོང་དུ་བབ།
en: Who has descended to the lower realms?

source: སུ་ནི་ངས་ངན་སོང་ལས་ཕྱུང་སྟེ་མཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: སུ་ནི་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལག་ནས་དྲང་བར་བྱ།
en: Whom, mired in misdeeds, shall I lift up by the hand?

source: སུ་ལ་ནི་སངས་རྒྱས་བྱུང་བས་བརྒྱན་པའི་འཇིག་རྟེན་འབྲས་བུ་དང་བཅས་པར་བྱ་
en: For whom shall I cause this world, adorned with a buddha’s presence, to be fruitful?”

source: སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ། །
en: These are their thoughts as they look out in wisdom:

source: དེ་བཞིན་དུ་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱང་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་ལྟ་བར་བྱེད་དོ། །
en: so too the great listeners regard the world with their listener’s eyes six times throughout the day and night—three times by day and three times by night.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་བལྟས་ན་
en: When Venerable Śāriputra regarded the world with his listener’s eyes,

source: ཁྱིམ་བདག་འཁོར་དང་བཅས་པ་གདུལ་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: he knew that the time had come to tame the householder and his retinue.

source: སྔ་དྲོ་ཤམ་ཐབས་དང་། ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་ངོ་། །
en: In the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་མཐར་གྱིས་བསོད་སྙོམས་ལ་རྒྱུ་བ་ལས། ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་བ་དང་།
en: As he went for alms, Venerable Śāriputra eventually came to the home of that householder.

source: ཁྱི་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཤུགས་དྲག་པོས་བརྒྱུགས་ཏེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཟིན་ཏོ། །དེའི་ཆོས་གོས་རྣམས་དྲལ་ཏོ། །
en: The dog caught sight of Venerable Śāriputra, ran with all his might, bit him, and tore his Dharma robes.

source: ཁྱིམ་བདག་དེས་ཀྱང་མཐོང་ནས་བཀག་སྟེ།
en: The householder saw this and immediately stopped the dog.

source: དེའི་རྨ་དེ་ཡང་བཀྲུས་ནས། རས་ཀྱིས་དཀྲིས་ཏེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: When he had washed Venerable Śāriputra’s wounds and wrapped them with cloth, he bowed down at his feet and implored him,

source: བཙུན་པ་ཤཱ་རིའི་བུ་འདི་ཉིད་དུ་བཤོས་གསོལ་དུ་ཅི་གནང་ཞེས་བྱས་ནས།
en: “Lord Śāriputra, please take your food here.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། ཁྱིམ་བདག་དེ་ལ་ཅང་མི་སྨྲ་བས་གནང་ངོ་། །
en: Venerable Śāriputra assented to the householder by his silence.

source: དེ་ནས་ཁྱིམ་བདག་དེས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཅང་མི་སྨྲ་བས་གནང་བར་རིག་ནས། སྟན་བཤམས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Understanding that by his silence Venerable Śāriputra had given his assent, the householder then prepared a seat for him and said,

source: བཙུན་པ་ཤཱ་རིའི་བུ། གདན་བཤམས་པ་ལ་བཞུགས་སུ་གསོལ།
en: “Venerable Śāriputra, please sit upon the seat that I have prepared,”

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམ་གྲངས་དུ་མས་ཚིམ་པར་བྱས་ཏེ་ཅི་འདོད་པ་བསྟབས་ནས།
en: After the householder had contented him with many different kinds of good, wholesome foods by his own hand, and had proffered all that he wished,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། དེའི་ཉིན་པར་ཟན་ཟོས་པའི་འོག་ཏུ་ཁྱི་དེ་ལ་ཁྱོས་མ་བྱིན་ཏེ།
en: Venerable Śāriputra partook of the day’s meal and gave his remaining food to the dog.

source: ཁྱི་དེས་ཟོས་ནས་དེའི་གདོང་དུ་བལྟས་སོ། །
en: When he had finished eating it, the dog looked up at Venerable Śāriputra’s face.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཟན་ཟོས་ཟིན་ཏེ། སྡེར་ནི་གྱུ་ལྷུང་བཟེད་ནི་བཀྲུས་པར་རིག་ནས་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: Once the householder knew that Venerable Śāriputra had finished eating and that his bowl had been taken away and his hands washed, he sat before him to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་རྟོགས་ནས། དེ་དང་འཐུན་པའི་ཆོས་སྟོན་པར་བྱེད་དེ།
en: Venerable Śāriputra directly apprehended the thoughts, habitual tendencies, temperament, and nature of the householder and his retinue, and taught them the Dharma accordingly.

source: དེ་ཐོས་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས། སྟན་དེ་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: After hearing it, the householder and his retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ཏེ།
en: Having seen the truths, they went for refuge and took the fundamental precepts.

source: སྨྲས་པ་བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་བདག་ལས་གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་བཞེས་པར་གསོལ།
en: “Lord Śāriputra,” said the householder, “for as long as I live, please accept from me your provisions of clothing, food, bedding, seat, and medicines to cure the sick.”

source: ཁྱིམ་བདག་གཞན་དག་ལ་ཡང་ཕན་གདགས་དགོས་ཀྱིས་ཐོང་ཤིག་ཅེས་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: “There are other householders I must help as well. Please allow me to go.” At this, he rose from his seat and departed.

source: དེར་གང་གི་ཚེ་ཁྱིམ་བདག་དེས་བདེན་པ་རྣམས་མཐོང་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་པ་དེའི་ཚེ་དེས་སྦྱིན་པ་དག་སྦྱིན་པ་དང་བསོད་ནམས་དག་བྱ་བར་བརྩམས་སོ། །
en: After the householder had seen the truths, gone for refuge, and taken the fundamental precepts, he began to give gifts and make merit.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཡང་དུས་དུས་སུ་སྤྱན་དྲངས་ཏེ། བཤོས་གསོལ་བར་བྱེད་དོ། །
en: From time to time he would also extend an invitation to Venerable Śāriputra and make food for him.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཀྱང་ཟན་ཟོས་པའི་འོག་ཏུ་ཁྱི་དེ་ལ་ཁྱོས་མ་བྱིན་པར་བྱེད་དོ། །
en: After eating, Venerable Śāriputra would give the remaining food to the dog.

source: ཁྱི་དེ་ཡང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: The dog was very happy with Venerable Śāriputra.

source: དེ་དགའ་བར་གྱུར་ནས་གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ། ཁྱིམ་དེར་འོང་བ་དེའི་ཚེ། ཁྱི་དེས་བསུ་ནས་རྐང་པ་ལ་བལྡགས་ཏེ་མཇུག་མ་དྲིལ་ནས་ལན་གསུམ་སྐོར་བ་བྱེད་དོ། །
en: He was so happy that whenever Venerable Śāriputra came to the house, he greeted him, licked his feet, and circumambulated him three times while wagging his tail.

source: དེར་གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཆོས་བཤད་ནས་ཕྱིར་འགྲོ་བ་དེའི་ཚེ་ཁྱི་དེས་ཐེ་གི་ཟད་ཙམ་དུ་བསྐྱལ་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་ཕྱིར་ལྡོག་གོ། །
en: Whenever Venerable Śāriputra came to give a Dharma talk and the time came for him to leave, the dog escorted him a little distance, then circumambulated him three times before he went away.

source: དེ་ནས་ཕྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། ཡང་ཁྱིམ་དེར་ཟན་ཟོས་ཏེ་ཁྱིམ་བདག་དེ་ལ་ཆོས་བཤད་ནས་
en: One day Venerable Śāriputra came to the house again, took his food, and gave a Dharma talk to the householder.

source: ཕྱིར་འགྲོ་བ་ན་ཁྱི་དེ་ཡང་ཕྱི་བཞིན་འབྲང་སྟེ། ཕྱི་རོལ་གྱི་ལམ་པོ་ཆེར་སོང་ནས་ལྕེས་རྐང་པ་ལ་བལྡགས་ཏེ། མཇུག་མ་དྲིལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: As he was departing, the dog followed him outside onto the main road, licked his feet, and circumambulated him three times while wagging his tail.

source: ཕྱིར་ལོག་ནས་ཁྱིམ་དུ་འགྲོ་བ་ན། ཁྱི་དེ་ཁྱི་གཞན་དག་ཅིག་གིས་བཅས་ནས་བསད་དོ། །
en: As the dog was returning to the house, some other dogs tore him apart, killing him.

source: དེ་ནས་དེ་གནས་བརྟན་ཤཱ་རིའི་བུ་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ་འདས་ནས་ཁྱིམ་དེ་ཉིད་དུ་ཁྱིམ་བདག་དེའི་ཆུང་མ་ཆེན་མའི་མངལ་དུ་སྐྱེས་སོ། །
en: He died filled with joy at the thought of the elder monk Śāriputra, transmigrated, and took rebirth in the same house, in the womb of the householder’s wife.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཀྱང་ཁྱི་དེ་བདག་གི་ཐད་ནས་ཕྱིར་ལྡོག་པའི་འོག་ཏུ་ཁྱི་གཞན་དག་གིས་ཇི་ལྟར་བསད་པ་ཤེས་སོ། །
en: Venerable Śāriputra knew just how the dog had been killed by the other dogs after they had parted.

source: དེ་ནས་དེས་བསམས་པ་ཁྱི་དེ་གར་སྐྱེས་སྙམ་པ་དང་། ཁྱིམ་བདག་དེ་ཉིད་ཀྱི་ཁྱིམ་དུ་ཁྱིམ་བདག་གི་ཆུང་མའི་མངལ་དུ་སྐྱེས་པར་མཐོང་ངོ་། །
en: He contemplated where the dog would take rebirth, and saw that it would be in the same house, in the womb of the householder’s wife.

source: མཐོང་ནས་ཀྱང་དེ་ཉིད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་གཡོག་མེད་པར་གཅིག་པུ་ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་སོང་བ་དང་།
en: Upon seeing this, out of love for the dog he went to the householder’s home alone, without attendants.

source: ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཟླ་མེད་པ་དང་། གཡོག་མེད་པར་གཅིག་པུ་འོང་བར་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་
en: The householder saw that Venerable Śāriputra was alone, without companions or attendants, and he inquired,

source: འཕགས་པ་ཁྱོད་ཅིའི་སླད་དུ་ཟླ་མ་མཆིས་པ་དང་། ཞམ་རིང་མ་མཆིས་པར་གཅིག་པུ་གཤེགས།
en: “Noble one, why have you come here alone, without companions or attendants?

source: འཕགས་པའི་ཞམ་རིང་བགྱིད་པ་འགའ་ཡང་མ་མཆིས་སམ་ཞེས་དྲིས་སོ། །
en: Noble one, is there no one at all who could attend you?”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། ཁྱེད་ཅག་ལྟ་བུ་འབའ་ཞིག་གིས་བྱིན་པ་མ་གཏོགས་པར་བདག་ཅག་ལ་གུད་ན་གཡོག་གི་འབྱུང་ཁུངས་ག་ལ་ཡོད།
en: “Where shall we find attendants, if one such as yourself does not grant them to us?” replied Venerable Śāriputra.

source: ཁྱིམ་བདག་གིས་སྨྲས་པ།
en: The householder said to him,

source: བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གི་མཆིས་བྲང་ལ་བུ་ཆགས་པ་མཆིས་ཀྱིས། དེ་ལས་གལ་ཏེ་ཁྱེའུ་ཞིག་བཙས་པར་གྱུར་ན། དེ་བདག་གིས་འཕགས་པའི་ཞམ་རིང་དུ་དབུལ་ལོ། །
en: “Lord Śāriputra, my wife has conceived, so if we have a son, noble one, I shall offer him to you as an attendant.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ནོ། །
en: “The virtuous keep their promises,” said Venerable Śāriputra.

source: དེ་སྐད་ཅེས་སྨྲས་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སོང་ངོ་། །
en: Having spoken thus, Venerable Śāriputra departed.

source: ཁྱིམ་བདག་དེའི་ཆུང་མ་ཡང་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་། བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་མོད་ཀྱི་འོན་ཀྱང་མིག་ཆུང་ངོ་། །
en: After nine or ten months had passed, the householder’s wife gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, though his eyes were small.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?”

source: ཁྱེའུ་འདི་མིག་ཆུང་བས་ན་མིང་མིག་ཆུང་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since the child’s eyes are small, his name will be Little Eyes.”

source: དེ་ནས་ཁྱེའུ་མིག་ཆུང་འོ་མ་དང་། ཞོ་དང་མར་དང་ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Little Eyes on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་།
en: As he grew up he studied letters, tallying, and arithmetic;

source: ཤོད་དགོད་པ་དང་ལག་རྩིས་དང་དབྱུང་བ་དང་། སྦ་བ་དང་དགྲམ་པ་དང་
en: the study of seals, lending, deposits, and commerce;
